Cinema/src/DataProcessors/ЗагрузкаСКиноПоиска/ЗагрузкаСКиноПоиска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаСКиноПоиска</name>
  <comment>Тестовый вариант</comment>
</mdclass:DataProcessor>

Cinema/src/Catalogs/Фильмы/Фильмы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Фильмы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Афиша</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВФильмотеке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполненКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НужноСкачать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОригинальноеНазвание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПросмотреноВКино</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Формат3D</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойРелиз</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Cinema/src/DataProcessors/ЗагрузкаСКиноПоиска/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	УстановитьУсловноеОформление(ЭтотОбъект);
	
	ТекДатаСеанса = ТекущаяДатаСеанса();
	ДатаПремьеры  = РассчитатьДатуПремьеры(ТекДатаСеанса);
	ПутьКСтранице = ПолучитьПутьКСтранице(ДатаПремьеры); 
	ГруппаФильмов = ПолучитьГруппуФильмов(ДатаПремьеры);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПремьерыПриИзменении(Элемент)
	
	ДатаПремьеры  = РассчитатьДатуПремьеры(ДатаПремьеры);
	ПутьКСтранице = ПолучитьПутьКСтранице(ДатаПремьеры);
	ГруппаФильмов = ПолучитьГруппуФильмов(ДатаПремьеры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагружаемыеФильмыЖанрыПриИзменении(Элемент)

	ТекДанные = Элементы.ЗагружаемыеФильмы.ТекущиеДанные;
	ТекДанные.Жанры = ОбщийМодульКлиентСервер.УдалитьПробелыМеждуРазделителями(СтрЗаменить(ТекДанные.Жанры, Символ(182), ""));
	
	ПроверитьСуществованиеЭлементовНаКлиенте(ТекДанные.Жанры, "Жанры");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагружаемыеФильмыСтраныПриИзменении(Элемент)

	ТекДанные = Элементы.ЗагружаемыеФильмы.ТекущиеДанные;
	ТекДанные.Страны = ОбщийМодульКлиентСервер.УдалитьПробелыМеждуРазделителями(СтрЗаменить(ТекДанные.Страны, Символ(182), ""));
	
	ПроверитьСуществованиеЭлементовНаКлиенте(ТекДанные.Страны, "Страны");
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Веб-страница (*.html)|*.html|Веб-страница (*.htm)|*.htm";
	Диалог.Показать(Новый ОписаниеОповещения("ПослеЗакрытияДиалогаВыбораФайла", ЭтотОбъект));

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьСКиноПоиска(Команда)

	ЗагрузитьСКиноПоискаНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьФильмы(Команда)
	
	СоздатьФильмыНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицу(Команда)

	ЗагружаемыеФильмы.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)

	ИзменитьФлажкиНаКлиенте(Истина);
	
	ЗаполнитьИмющиесяФильмыНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)

	ИзменитьФлажкиНаКлиенте(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция РассчитатьДатуПремьеры(Знач ТекДата)

	ТекДеньНедели = ДеньНедели(ТекДата);
	
	Если ТекДеньНедели <> 4 Тогда
		ТекДата = НачалоНедели(ТекДата) + 60*60*24*3;
	КонецЕсли;
	
	Возврат ТекДата;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПутьКСтранице(ДатаПремьеры)

	ДатаПремьерыСтр = Формат(ДатаПремьеры, "ДФ=yyyy-MM-dd");
	
	Возврат "/premiere/ru/date/" + ДатаПремьерыСтр + "/";

КонецФункции

&НаКлиенте
Процедура ЗагрузитьСКиноПоискаНаКлиенте()
	
	ЗагружаемыеФильмы.Очистить();
	
	#Если Не ВебКлиент И НЕ МобильныйКлиент Тогда
	Если Элементы.ГруппаПутьКСтранице.ТекущаяСтраница = Элементы.ОнЛайн Тогда
		ВременныйФайл = ПолучитьИмяВременногоФайла("html");
		Попытка
			Соединение	= Новый HTTPСоединение("www.kinopoisk.ru", , , , , , Новый ЗащищенноеСоединениеOpenSSL());
			Соединение.Получить(ПутьКСтранице, ВременныйФайл);
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка подключения к сайту; по причине: " + ОписаниеОшибки();
			Сообщение.Сообщить();
			Возврат;
		КонецПопытки;
	Иначе
		ВременныйФайл = ПутьКФайлу;
	КонецЕсли;
		
	ТекущийФайл  = Новый Файл(ВременныйФайл);
	СтраницаHTML = Новый ТекстовыйДокумент;
	ДопПараметры = Новый Структура("СтраницаHTML, ВременныйФайл, ИмяФайла", СтраницаHTML, ВременныйФайл, ТекущийФайл.Имя);
	ОпОписание   = Новый ОписаниеОповещения("ПослеЗавершенияЧтенияФайла", ЭтотОбъект, ДопПараметры, "ПриВозникновенииОшибкиЧтенияФайла", ЭтотОбъект);
	СтраницаHTML.НачатьЧтение(ОпОписание, ВременныйФайл, КодировкаТекста.UTF8);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВозникновенииОшибкиЧтенияФайла(Инфо, СтандартнаяОбработка, ДопПараметры) Экспорт

	СтандартнаяОбработка = Ложь;
	Описание = ?(Инфо.Причина = Неопределено, Инфо.Описание, Инфо.Причина.Описание);
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон(НСтр("ru = 'Ошибка открытия файла %1; по причине: %2.'"), ДопПараметры.ИмяФайла, Описание);
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияЧтенияФайла(ДополнительныеПараметры) Экспорт
	
	КлассБлок     = "<div class=""textBlock"">";
	КонецБлока    = "</div>";
	НачЭлемента   = "<span>";
	КонецЭлемента = "</span>";
	КлассИмя      = "class=""name""";
	Многоточие    = "...";
	ВхКартинки    = "<img src=";
	ЗагКартинки   = "title=""";
	ДлЗаголовка   = СтрДлина(ЗагКартинки);
	БлокНачСтрана = "<span style=""margin: 0"">";
	ТэгКурсив     = "<i>";
	
	ФайлHTML	= ДополнительныеПараметры.СтраницаHTML;
	ТекущийHTML	= ФайлHTML.ПолучитьТекст();
	ТекстHTML	= СтрЗаменить(ТекущийHTML, Символы.ПС, "");
	МассивСтрок = Новый Массив;
	Вхождение	= СтрНайти(ТекстHTML, КлассБлок, НаправлениеПоиска.СКонца);
	СтрокТекста	= СтрЧислоСтрок(ТекущийHTML);
	
 	RegExp			= Новый COMОбъект("VBScript.RegExp");
    RegExp.Global	= Истина;    // Поиск всех вхождений шаблона   
	RegExp.Pattern	= "<[^>]*>"; // Удаляем HTML-тэги
	
	Пока Вхождение > 0 Цикл
		
		КолСимволов	= СтрДлина(ТекстHTML);
		ТекСтрока	= Прав(ТекстHTML, КолСимволов-Вхождение+1);
		ТекстHTML	= СтрЗаменить(ТекстHTML, ТекСтрока, "");
		Вхождение	= СтрНайти(ТекстHTML, КлассБлок, НаправлениеПоиска.СКонца);
		Окончание	= СтрНайти(ТекСтрока, КонецБлока);
		
		Если Окончание > 0 Тогда
			ТекСтрока = СокрЛП(Лев(ТекСтрока, Окончание-1));
			МассивСтрок.Добавить(СокрЛП(СтрЗаменить(ТекСтрока, КлассБлок, "")));
		КонецЕсли;

	КонецЦикла;
	
	Для каждого ТекСтрока Из МассивСтрок Цикл
		
		МнчСтрока    = СтрЗаменить(ТекСтрока, КонецЭлемента, Символы.ПС);
		ЧислоСтрок   = СтрЧислоСтрок(МнчСтрока);
		Наименование = "";
		ОригНаименов = "";
		ТекЖанры     = "";
		ТекСтраны    = "";
		
		Для ИндексСтроки = 1 По ЧислоСтрок Цикл
		
			ТекПодСтрока = СокрЛП(СтрПолучитьСтроку(МнчСтрока, ИндексСтроки));
			Если СтрНайти(ТекПодСтрока, КлассИмя) > 0 Тогда
				Наименование = СокрЛП(RegExp.Replace(ТекПодСтрока, ""));
			ИначеЕсли СтрНайти(ТекПодСтрока, НачЭлемента) > 0 Тогда
				Если ПустаяСтрока(ОригНаименов) Тогда
					ОригНаименов = СокрЛП(СтрЗаменить(RegExp.Replace(ТекПодСтрока, ""), "&amp;", "&"));
				Иначе
					Если ПустаяСтрока(ТекЖанры) И СтрНайти(ТекПодСтрока, Многоточие) = 0 Тогда
						ТекЖанры = СокрЛП(RegExp.Replace(ТекПодСтрока, ""));
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли СтрНайти(ТекПодСтрока, БлокНачСтрана) > 0 Тогда
				Вхождение = СтрНайти(ТекПодСтрока, ТэгКурсив);
				Если Вхождение > 0 Тогда
					ТекСтраны = СокрЛП(СтрЗаменить(Лев(ТекПодСтрока, Вхождение-1), БлокНачСтрана, ""));
					Если СтрНайти(ТекСтраны, Многоточие) > 0 Тогда
						ТекСтраны = "";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		
		КонецЦикла;
	
		Если НЕ ПустаяСтрока(Наименование) Тогда
			НоваяСтрока = ЗагружаемыеФильмы.Добавить();
			НоваяСтрока.Наименование = Наименование;
			НоваяСтрока.ОригинальноеНазвание = ОригНаименов;
			НоваяСтрока.Жанры = ТекЖанры;
			НоваяСтрока.Страны = ТекСтраны;
		КонецЕсли;
	
	КонецЦикла;
	
	RegExp.Pattern	= "\(20[0-9][0-9]\)";
	
	Для каждого СтрокаКоллекции Из ЗагружаемыеФильмы Цикл
		
		// st.kp.yandex.net/images/film_big/xxx.jpg
		
		СтрокаКоллекции.Жанры = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрокаКоллекции.Жанры, ")", ""), "(", ""), " ", "");
		СтрокаКоллекции.ОригинальноеНазвание = СокрЛП(RegExp.Replace(СтрокаКоллекции.ОригинальноеНазвание, ""));
		СтраныДлина = СтрДлина(СтрокаКоллекции.Страны);
		Если СтраныДлина > 0 И Прав(СтрокаКоллекции.Страны, 1) = "," Тогда
			СтрокаКоллекции.Страны = Лев(СтрокаКоллекции.Страны, СтраныДлина-1);
		КонецЕсли;	
		
		ПутьКИзображению = "";
		ВременныйТекст   = ТекущийHTML;
		Вхождение = СтрНайти(ВременныйТекст, ВхКартинки, НаправлениеПоиска.СКонца);
		Пока Вхождение > 0 Цикл
			ВременнаяСтрока	= Сред(ВременныйТекст, Вхождение);
			ВременныйТекст	= СтрЗаменить(ВременныйТекст, ВременнаяСтрока, "");
			Вхождение		= СтрНайти(ВременнаяСтрока, """" + СтрокаКоллекции.Наименование + """");
			Если Вхождение > 0 Тогда
				Вхождение = СтрНайти(ВременнаяСтрока, ЗагКартинки);
				Если Вхождение > 0 Тогда
					ВременнаяСтрока = Сред(ВременнаяСтрока, Вхождение+ДлЗаголовка);
					Вхождение = СтрНайти(ВременнаяСтрока, """");
					Если Вхождение > 0 Тогда
						ПутьКИзображению = Лев(ВременнаяСтрока, Вхождение-1);
					КонецЕсли;
				КонецЕсли;
				Если НЕ ПустаяСтрока(ПутьКИзображению) Тогда
					СтрокаКоллекции.ПутьКАфише = СтрЗаменить(ПутьКИзображению, "sm_film", "film_big");
					Прервать;
				КонецЕсли;
			КонецЕсли;
			Вхождение = СтрНайти(ВременныйТекст, ВхКартинки, НаправлениеПоиска.СКонца);
		КонецЦикла;
	
	КонецЦикла;
	
	ЗаполнитьИмющиесяФильмыНаСервере();
	
	НачатьУдалениеФайлов(, ДополнительныеПараметры.ВременныйФайл);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьФильмыНаКлиенте()
	
	#Если Не ВебКлиент И НЕ МобильныйКлиент Тогда
		
	ВременныйФайл = ПолучитьИмяВременногоФайла();
	ХранилищеJpeg = "st.kp.yandex.net";
	ХранилищеWebp = "avatars.mds.yandex.net";

	Для каждого ТекСтрока Из ЗагружаемыеФильмы Цикл
		
		Если НЕ ТекСтрока.Создавать Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьКАфише = СокрЛП(ТекСтрока.ПутьКАфише);
		
		Если ПустаяСтрока(ПутьКАфише) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Соединение   = Новый HTTPСоединение(ХранилищеJpeg, , , , , , Новый ЗащищенноеСоединениеOpenSSL());
			ОтветСервера = Соединение.Получить(ПутьКАфише, ВременныйФайл);
			Нахождение   = ОтветСервера.Заголовки.Получить("Location");
			Если Нахождение <> Неопределено Тогда
				Соединение   = Новый HTTPСоединение(ХранилищеWebp, , , , , , Новый ЗащищенноеСоединениеOpenSSL());
				Нахождение   = СтрЗаменить(Нахождение, "https://" + ХранилищеWebp, "");
				ОтветСервера = Соединение.Получить(Нахождение, ВременныйФайл);
			КонецЕсли;
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка подключения к сайту; по причине: " + ОписаниеОшибки();
			Сообщение.Сообщить();
			Возврат;
		КонецПопытки;
		
		ТекСтрока.Афиша = Новый Картинка(ВременныйФайл);

		Если ТекСтрока.Афиша.Формат() = ФорматКартинки.НеизвестныйФормат Тогда
			АдресВХранилище = ПоместитьВоВременноеХранилище(ТекСтрока.Афиша, ЭтотОбъект.УникальныйИдентификатор);
			АдресВХранилище = КонвертироватьФайлНаСервере(АдресВХранилище);
			Если ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда
				ТекСтрока.Афиша = ПолучитьИзВременногоХранилища(АдресВХранилище);
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;
	
	НачатьУдалениеФайлов(Новый ОписаниеОповещения("ПослеЗавершенияУдаленияФайлов", ЭтотОбъект), ВременныйФайл);
	
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияУдаленияФайлов(ДополнительныеПараметры) Экспорт
	
	СоздатьФильмыНаСервере();

КонецПроцедуры

&НаСервере
Процедура СоздатьФильмыНаСервере()

	Для каждого ТекСтрока Из ЗагружаемыеФильмы Цикл
		
		Если ПустаяСтрока(ТекСтрока.Наименование) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ТекСтрока.Создавать Тогда
			Продолжить;
		КонецЕсли;
		
		СпрОбъект = Справочники.Фильмы.СоздатьЭлемент();
		СпрОбъект.Родитель = ГруппаФильмов;
		СпрОбъект.Наименование = ТекСтрока.Наименование;
		СпрОбъект.ОригинальноеНазвание = ТекСтрока.ОригинальноеНазвание;
		СпрОбъект.ДатаВыхода = ДатаПремьеры;
		Если ТипЗнч(ТекСтрока.Афиша) = Тип("Картинка") Тогда
			СпрОбъект.Афиша = Новый ХранилищеЗначения(ТекСтрока.Афиша);
			СпрОбъект.ВысотаИзображения = ТекСтрока.Афиша.Высота();
			СпрОбъект.ШиринаИзображения = ТекСтрока.Афиша.Ширина();
			ДвоичДанные = ТекСтрока.Афиша.ПолучитьДвоичныеДанные();
		Иначе
			ДвоичДанные = Неопределено;
		КонецЕсли;
		
		Если ДвоичДанные <> Неопределено Тогда
			СпрОбъект.РазмерИзображения = ДвоичДанные.Размер();
		КонецЕсли;
		
		Попытка
		    СпрОбъект.Записать();
			ТекСтрока.Фильм = СпрОбъект.Ссылка;
			ТекСтрока.Создавать = Ложь;
		Исключение
			ТекстСообщения = НСтр("ru = 'Ошибка записи фильма %1; по причине: %2!'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ТекСтрока.Наименование, ОписаниеОшибки());
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла;
	
	СоздаваемыеФильмы = Новый ТаблицаЗначений;
	СоздаваемыеФильмы.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(250, ДопустимаяДлина.Переменная)));
	СоздаваемыеФильмы.Колонки.Добавить("Фильм", Новый ОписаниеТипов("СправочникСсылка.Фильмы"));
	СоздаваемыеФильмы.Колонки.Добавить("Страны");
	СоздаваемыеФильмы.Колонки.Добавить("Жанры");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТЗ.Фильм КАК Фильм,
		|	ТЗ.Страны КАК Страны,
		|	ТЗ.Жанры КАК Жанры
		|ПОМЕСТИТЬ ИсходныеДанные
		|ИЗ
		|	&ТЗ КАК ТЗ
		|ГДЕ
		|	ТЗ.Фильм <> ЗНАЧЕНИЕ(Справочник.Фильмы.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Страны.Ссылка КАК Ссылка,
		|	Страны.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Страны КАК Страны
		|ГДЕ
		|	Страны.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Жанры.Ссылка КАК Ссылка,
		|	Жанры.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Жанры КАК Жанры
		|ГДЕ
		|	Жанры.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсходныеДанные.Фильм КАК Фильм,
		|	ИсходныеДанные.Страны КАК СтрокаСтраны,
		|	ИсходныеДанные.Жанры КАК СтрокаЖанры
		|ИЗ
		|	ИсходныеДанные КАК ИсходныеДанные";
	Запрос.УстановитьПараметр("ТЗ", ЗагружаемыеФильмы.Выгрузить());
	
	Результаты = Запрос.ВыполнитьПакет();
	МаксИндекс = Результаты.ВГраница();
	тРезультат = Результаты.Получить(МаксИндекс);
	
	Если тРезультат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НетДанныхВБазе	= Новый Массив;
	СтруктураПоиска = Новый Структура("Наименование");
	ВыборкаЖанры	= Результаты.Получить(МаксИндекс-1).Выбрать();
	ВыборкаСтраны	= Результаты.Получить(МаксИндекс-2).Выбрать();
	ВыборкаСтроки	= тРезультат.Выбрать();
	
	Пока ВыборкаСтроки.Следующий() Цикл

		Отказ     = Ложь;
		ТекСтрока = Неопределено;
		ТекСтраны = Новый Соответствие;
		ТекЖанры  = Новый Соответствие;
		
		Если НЕ ПустаяСтрока(ВыборкаСтроки.СтрокаЖанры) Тогда
			ЗаполнитьСтруктуруДанныхНаСервере(ВыборкаСтроки.СтрокаЖанры, ВыборкаЖанры, ТекЖанры, СтруктураПоиска, НетДанныхВБазе, Отказ, Истина);
			Если НЕ Отказ Тогда
				ТекСтрока = СоздаваемыеФильмы.Добавить();
				ТекСтрока.Фильм = ВыборкаСтроки.Фильм;
				ТекСтрока.Жанры = ТекЖанры;
			КонецЕсли;
		КонецЕсли;
		
		Отказ = Ложь;
		
		Если НЕ ПустаяСтрока(ВыборкаСтроки.СтрокаСтраны) Тогда
			ЗаполнитьСтруктуруДанныхНаСервере(ВыборкаСтроки.СтрокаСтраны, ВыборкаСтраны, ТекСтраны, СтруктураПоиска, НетДанныхВБазе, Отказ);
			Если НЕ Отказ Тогда
				Если ТекСтрока = Неопределено Тогда
					ТекСтрока = СоздаваемыеФильмы.Добавить();
					ТекСтрока.Фильм = ВыборкаСтроки.Фильм;
				КонецЕсли;
				ТекСтрока.Страны = ТекСтраны;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого СтрокаТабличнойЧасти Из СоздаваемыеФильмы Цикл
		
		Если СтрокаТабличнойЧасти.Жанры <> Неопределено Тогда
			СоздатьЗаписиРегистраСведенийНаСервере(СтрокаТабличнойЧасти.Фильм, "ЖанрыФильмов", СтрокаТабличнойЧасти.Жанры, "Жанр");
		КонецЕсли;
	
		Если СтрокаТабличнойЧасти.Страны <> Неопределено Тогда
			СоздатьЗаписиРегистраСведенийНаСервере(СтрокаТабличнойЧасти.Фильм, "СтраныПроизводители", СтрокаТабличнойЧасти.Страны, "Страна");
		КонецЕсли;
		
	КонецЦикла;
	
	//ФоновыеЗадания.Выполнить("ОбщийМодульСервер.УменьшениеРазмеровИзображений", , УникальныйИдентификатор, НСтр("ru = 'Уменьшение размеров изображений'"));
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписиРегистраСведенийНаСервере(Фильм, ИмяРегистраСведений, ВхКоллекция, ИмяОтбора)

	Для каждого КлючИЗначение Из ВхКоллекция Цикл
		
		НаборЗаписей = РегистрыСведений[ИмяРегистраСведений].СоздатьНаборЗаписей();
		
		ЭлементОтбора = НаборЗаписей.Отбор[ИмяОтбора];
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.Значение = КлючИЗначение.Значение;
		
		НаборЗаписей.Отбор.Фильм.Установить(Фильм);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Фильм = Фильм;
		НоваяЗапись[ИмяОтбора] = КлючИЗначение.Значение;
		
		Попытка
		    НаборЗаписей.Записать();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(НСтр("ru = 'Ошибка записи элемента <%1> для фильма <%2>; по причине: %3.'"), КлючИЗначение.Значение, Фильм, ОписаниеОшибки());
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруДанныхНаСервере(ВыборкаСтроки, Выборка, ТекСоответствие, СтруктураПоиска, НетДанныхВБазе, Отказ, ПреобразоватьРегистр = Ложь)

	МассивПодстрок = СтрРазделить(ВыборкаСтроки, ",", Ложь);
	
	Для каждого ЭлементМассива Из МассивПодстрок Цикл
		
		Наименование = СокрЛП(ЭлементМассива);
		
		Если ПреобразоватьРегистр Тогда
			Наименование = СокрЛП(ТРег(ЭлементМассива));
		КонецЕсли;
		
		СтруктураПоиска.Наименование = Наименование;
		
		Выборка.Сбросить();
		Если Выборка.НайтиСледующий(СтруктураПоиска, "Наименование") Тогда
			ТекСоответствие.Вставить(Выборка.Наименование, Выборка.Ссылка);
		Иначе
			Отказ = Истина;
			Если НетДанныхВБазе.Найти(СтруктураПоиска.Наименование) = Неопределено Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон(НСтр("ru = 'Элемент справочника <%1> в ИБ не обнаружен!'"), СтруктураПоиска.Наименование);
				Сообщение.Сообщить();
				НетДанныхВБазе.Добавить(СтруктураПоиска.Наименование);
			КонецЕсли;
		КонецЕсли;
			
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФлажкиНаКлиенте(СостояниеФлажка)

	Для каждого СтрокаТаблицы Из ЗагружаемыеФильмы Цикл
		СтрокаТаблицы.Создавать = СостояниеФлажка;
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьГруппуФильмов(ДатаПремьеры)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Фильмы.Ссылка КАК ГруппаФильмов
		|ИЗ
		|	Справочник.Фильмы КАК Фильмы
		|ГДЕ
		|	НЕ Фильмы.ПометкаУдаления
		|	И Фильмы.ЭтоГруппа
		|	И Фильмы.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Формат(ДатаПремьеры, "ДФ=yyyy"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ПредопределенноеЗначение("Справочник.Фильмы.ПустаяСсылка");
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.ГруппаФильмов;

КонецФункции

&НаСервере
Процедура ЗаполнитьИмющиесяФильмыНаСервере()

	ТаблицаЗагружаемыхФильмов = РеквизитФормыВЗначение("ЗагружаемыеФильмы");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаФильмов.ПутьКАфише КАК ПутьКАфише,
		|	ТаблицаФильмов.Наименование КАК Наименование,
		|	ТаблицаФильмов.ОригинальноеНазвание КАК ОригинальноеНазвание,
		|	ТаблицаФильмов.Жанры КАК Жанры,
		|	ТаблицаФильмов.Страны КАК Страны
		|ПОМЕСТИТЬ ЗагружаемыеФильмы
		|ИЗ
		|	&ТаблицаЗагружаемыхФильмов КАК ТаблицаФильмов
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Ссылка КАК Фильм,
		|	Фильмы.Наименование КАК Наименование
		|ПОМЕСТИТЬ СуществующиеФильмы
		|ИЗ
		|	Справочник.Фильмы КАК Фильмы
		|ГДЕ
		|	НЕ Фильмы.ПометкаУдаления
		|	И НЕ Фильмы.ЭтоГруппа
		|	И Фильмы.Родитель = &ГруппаФильмов
		|	И Фильмы.Наименование В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ЗагружаемыеФильмы.Наименование КАК Наименование
		|			ИЗ
		|				ЗагружаемыеФильмы КАК ЗагружаемыеФильмы)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА СуществующиеФильмы.Наименование ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Создавать,
		|	ЗагружаемыеФильмы.Наименование КАК Наименование,
		|	ЗагружаемыеФильмы.ОригинальноеНазвание КАК ОригинальноеНазвание,
		|	ЗагружаемыеФильмы.ПутьКАфише КАК ПутьКАфише,
		|	ЗагружаемыеФильмы.Жанры КАК Жанры,
		|	ЗагружаемыеФильмы.Страны КАК Страны
		|ИЗ
		|	ЗагружаемыеФильмы КАК ЗагружаемыеФильмы
		|		ЛЕВОЕ СОЕДИНЕНИЕ СуществующиеФильмы КАК СуществующиеФильмы
		|		ПО ЗагружаемыеФильмы.Наименование = СуществующиеФильмы.Наименование";
	Запрос.УстановитьПараметр("ТаблицаЗагружаемыхФильмов", ТаблицаЗагружаемыхФильмов);
	Запрос.УстановитьПараметр("ГруппаФильмов", ГруппаФильмов);
	
	ЗагружаемыеФильмы.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьУсловноеОформление(Форма)
	
	Форма.УсловноеОформление.Элементы.Очистить();
	
	//

	НовыйЭлементУО = Форма.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = НовыйЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ЗагружаемыеФильмыОригинальноеНазвание");
	
	ОтборЭлементаУО = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлементаУО.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗагружаемыеФильмы.ОригинальноеНазвание");
	ОтборЭлементаУО.ВидСравнения   = ВидСравненияКомпоновкиДанных.Содержит;
	ОтборЭлементаУО.ПравоеЗначение = ";";
	
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЛососьСветлый);
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт( , , Истина));
	
	//

	НовыйЭлементУО = Форма.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = НовыйЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ЗагружаемыеФильмыНаименование");
	
	ОтборЭлементаУО = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлементаУО.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗагружаемыеФильмы.Наименование");
	ОтборЭлементаУО.ВидСравнения   = ВидСравненияКомпоновкиДанных.Содержит;
	ОтборЭлементаУО.ПравоеЗначение = ";";
	
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЛососьСветлый);
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт( , , Истина));
	
	//

	НовыйЭлементУО = Форма.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = НовыйЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ЗагружаемыеФильмыАфиша");
	
	ОтборЭлементаУО = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлементаУО.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗагружаемыеФильмы.ПутьКАфише");
	ОтборЭлементаУО.ВидСравнения   = ВидСравненияКомпоновкиДанных.Содержит;
	ОтборЭлементаУО.ПравоеЗначение = "no-poster.gif";
	
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СеребристоСерый);
	
	//
	
	НовыйЭлементУО = Форма.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = НовыйЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ЗагружаемыеФильмыСоздавать");
	
	ГруппаОтборУО   = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтборУО.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлементаУО = ГруппаОтборУО.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлементаУО.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗагружаемыеФильмы.Жанры");
	ОтборЭлементаУО.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;

	ОтборЭлементаУО = ГруппаОтборУО.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлементаУО.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗагружаемыеФильмы.Страны");
	ОтборЭлементаУО.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ОтборЭлементаУО = ГруппаОтборУО.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлементаУО.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗагружаемыеФильмы.Создавать");
	ОтборЭлементаУО.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлементаУО.ПравоеЗначение = Истина;
	
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый);

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСуществованиеЭлементовНаКлиенте(ПроверяемаяСтрока, ИмяСправочника)

	СинонимСправочника = ""; 

	МассивСтрок = СтрРазделить(ПроверяемаяСтрока, ",", Ложь);
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	СуществовующиеЭлементы = ПолучитьСуществующиеЭлементыНаСервере(ИмяСправочника, СинонимСправочника, МассивСтрок);

	Для каждого ТекСтрока Из МассивСтрок Цикл
	       ЗначениеЭлемента = СуществовующиеЭлементы.Получить(ВРег(ТекСтрока));
	       Если ЗначениеЭлемента = Неопределено Тогда
	               Сообщение = Новый СообщениеПользователю;
	               Сообщение.Текст = СтрШаблон(НСтр("ru = 'В справочнике ""%1"" отсутствует элемент ""%2"".'"), СинонимСправочника, ТекСтрока);
	               Сообщение.Сообщить();
	       КонецЕсли;
	КонецЦикла;
        
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСуществующиеЭлементыНаСервере(ИмяСправочника, СинонимСправочника, МассивСтрок)

	СоответствиеЭлементов = Новый Соответствие;
	Схема                 = Новый СхемаЗапроса;
	СинонимСправочника    = Метаданные.Справочники[ИмяСправочника].Синоним;

	Для каждого ЭлементСхемы Из Схема.ПакетЗапросов Цикл
	       Для каждого ОператорСхемы Из ЭлементСхемы.Операторы Цикл
	               ОператорСхемы.Источники.Добавить("Справочник." + ИмяСправочника);
	               ОператорСхемы.ВыбираемыеПоля.Добавить("Наименование");
	               ОператорСхемы.ВыбираемыеПоля.Добавить("Ссылка");
	               ОператорСхемы.Отбор.Добавить("Наименование В (&МассивСтрок)");
	               ОператорСхемы.Отбор.Добавить("ПометкаУдаления = ЛОЖЬ");
	       КонецЦикла;
	       ЭлементСхемы.ВыбиратьРазрешенные = Истина;
	       ЭлементСхемы.Порядок.Добавить("Наименование");
	КонецЦикла;

	Запрос = Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("МассивСтрок", МассивСтрок);

	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
	       Выборка = Результат.Выбрать();
	       Пока Выборка.Следующий() Цикл
	               СоответствиеЭлементов.Вставить(ВРег(Выборка.Наименование), Выборка.Ссылка);
	       КонецЦикла;
	КонецЕсли;

	Возврат СоответствиеЭлементов;
        
КонецФункции

&НаСервере
Функция КонвертироватьФайлНаСервере(АдресВХранилище)

	Обработки.ЗагрузкаСКиноПоиска.КонвертироватьФайлНаСервере(АдресВХранилище, ЭтотОбъект);
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияДиалогаВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() > 0 Тогда
		ПутьКФайлу = ВыбранныеФайлы.Получить(0);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
